{
  "visible": true,
  "date": "2020-06-22T18:58:27.099Z",
  "updated": "2098-06-22T18:58:27.134Z",
  "description": "This about page highlights how our relationship will work, the amount of control that you will have, my money-back guarantee, and what you can expect in terms of communication and output. To see the other about page - the one about who I am as a person - <a href='/words/about'>click here</a>.",
  "title": "Working with me is easy, fair, powerful, and... pleasant.",
  "content": "New relationships are hard. New business ones especially so. Mistrust, anxiety, and uncertainty lie at the heart of most new client-contractor relationships. And for good reason.\n\nEven though you probably came via word-of-mouth, you can't *really* trust me until you build your *own* experience with me. You can’t *really* know how good, fast, and cost-effective my work is until you see it with your own eyes.\n\nOn the other end, I don't trust you yet, either. Despite how much I might like your personality, your project, and your story... I can't *really* trust you until I build my *own* experience with you. I can’t *really* know if you're going to pay me on time or be pleasant to work with.\n\nSo what do we do?\n\nWell, we outline a framework that emphasizes expectations, transparency, and protections, so that both parties always feel in control. So that trust can be built slowly over time in a low-risk way.\n\nI’ve been doing contract work for eight years, and I’ve also hired contractors myself many times. During that time I've seen where things go right, where things go wrong, where human emotion comes into play, and what steps we can take to make sure that everybody is on the same page. This framework is a combination of that experience plus a whole lot of reflection. That said, your voice is just as important as mine in this relationship! So if there's anything you'd like to add or change, we can always modify the framework to meet your needs.\n\n## Expectations\n\n### 1. You will pay me USD $140 per hour.\n\nUnless otherwise agreed upon, you will pay me $140 per hour for all time spent working on your project. This includes time spent emailing you, time spent on Zoom calls with you, etc.\n\n### 2. I will maintain 90% or higher productivity.\n\nDuring each billable hour I will be high-octane working on your project for at least 54 minutes. When working, I am completely focused on your project, with all other projects, emails, browser tabs, etc closed. That said, I need the freedom to take the occassional bathroom break or jumping-jack break without having to feel guilty.\n\n### 3. Assuming things go well, you plan to spend at least USD $10,000 with me.\n\nThings change, and you’re free to stop working with me at any time, free of penalty. So this one is just on the honor system. If you don’t *plan* to spend at least $10,000 with me, please let me know up front, as I prefer not taking on micro-contracts.\n\n### 4. We will communicate with open hearts, especially when doing so is hard.\n\n\n\n## Transparency\n\n### 1. Look over my shoulder whenever you want.\n\nWhen my clock is on, so is my camera. For every session that I log, there will be a complete video recording of my screen for you to review. Of course the videos will be boring as hell, but that's not the point. The point is to give you peace of mind that I'm actually working. Because even though I don't diddle around when I work... you can't know that.\n\nThe exception to the above is when I'm working but my computer isn't open, like if I'm sketching something out in my notebook, or getting coffee with you, or going for a walk to think about next steps. Any such offline event will be clearly highlighted as such in your invoice.\n\n### 2. Daily updates.\n\nAt the end of each day you will receive an email containing how many hours I logged that day, what I accomplished, what my next steps are, your updated spend, and a link to the video feed mentioned above. You’ll also be able to access all of these updates in your client panel.\n\n### 3. Micro updates.\n\nWhen I work, I like to constantly post micro-updates about what I'm doing. This is mostly for my own benefit, as it helps me think through a problem, and also helps me keep track of all the things that need to be done. I make this log public to you so that you can follow along in real-time, if you want.\n\n## Control\n\n### 1. Set daily, weekly, and total spend limits.\n\nYou should never have to worry about whether you're running up a tab or not. Via your client panel, you can set daily, weekly, and total spend limits, and you can adjust them at any time. I will automatically be alerted 30 minutes prior to reaching a limit so that I can wrap up whatever I'm working on, and then the timer will automatically stop when a limit is reached.\n\n### 2. Daily credit/debit card billing.\n\nUnless otherwise agreed upon, all hours will be billed daily via Stripe, at midnight Pacific Time. If a payment fails, I will stop working on your project until the payment goes through. And if the payment never goes through, I will not seek to collect, as losing a single day's pay is a risk I'm willing to take, and honestly not worth the headache or cost of litigation. This strategy lets me never worry about if and when I’m going to be paid, which lets me give you my full attention from day one even before we've built trust. \n\n### 3. Hit the Emergency Brake button whenever you want.\n\nYou will have a big red button on your client panel that says 'Emergency Brake'. Hit this at any time and I will immediately stop working on your project, your timer will automatically stop, and you will not be billed again. We will then setup a free call to discuss what's going on, and will resume only if and when you're ready to. This button exists to protect you in the event that you’re seeing charges mount but you're not seeing the results you were hoping for. Note that if you use this button too many times I’ll probably drop you as a client, because it hugely interrupts my flow, but I’ll never penalize anybody for using it every now and again.\n\n### 4. Get a full refund on your most-recent bill.\n\nWith daily billing, it’s your responsibility to stay on top of the project, set reasonable spend limits, and make sure that you’re happy with the results. That said, you can’t monitor this every minute of every day. And for this reason, if you’re ever unhappy with progress, you can get a full refund on the most recent bill. Note that this will end our relationship.\n\n---\n\nThe framework above is a starting point to get us off the ground. It need not be the end point."
}