{
  "title": "Hire Me",
  "intro": "I’m really good at what I do. But you can’t know that yet. So... let’s work together in a fresh way that doesn’t require a leap of faith.\n\n[Email me](mailto:hey@patgriffith.com) and we’ll work together *for free* for one week. Then if we’re a good fit, you can hire me for between $250 (light consulting) and $2,500 (heavy implementation) per week.",
  "expands": [
    {
      "title": "Weekly billing.",
      "content": "I’m fundamentally opposed to hourly work. I want to sell you value, not time.\n\nI’m also fundamentally opposed to fixed-cost projects, because these are only feasible with an impossibly defined scope. \n\n So instead I charge weekly, and I work as many (or as few) hours per week as necessary to provide you with more value than you're paying for."
    },
    {
      "title": "Discounted and Pro bono work.",
      "content": "Does your organization focus on justice (racial, climate, etc), health (physical, mental, etc), or any other project that is unambiguously good for humanity?\n\nAnd are you unable to pay my fee?\n\nIf you answered 'yes' to both questions... let's talk. I care about social impact far more than I care about money, and as such I'm happy to provide free or discounted services to good causes."
    },
    {
      "title": "Working for equity.",
      "content": "Under certain circumstances I’m quite jazzed to work for equity. And frankly, I find it a little suspicious that most won't. 'Cuz I’m a risk-tolerant guy with ultra low expenses and zero dependents. So there are only three reasons why I wouldn't accept equity.\n\n1. I don't believe in your project's mission.\n2. I don't believe in your project's ability to make money.\n3. I don't believe in you or your team.\n\nIn all three of those cases... I should say no to your project. Right?\n\nSo, yeah, I'm happy to put ~~my~~ your money where my mouth is. I want to be paid a minimum of **$2,500/month** in order to live comfortably, but am happy to accept some or all of the remaining payment in the form of equity."
    }
  ]
}