{
  "expands": [
    {
      "title": "UI/UX Designer",
      "content": "I have a good eye for design, many have said. Sometimes I just rip stuff from [Sketch Repo](https://sketchrepo.com/) and then mold it to my needs using, as you might imagine, [Sketch](https://www.sketch.com/). Other times I design stuff from scratch. Whatever works.\n\nAnd as for UX: back during my DealCatcher days I read literally every single [Nielsen Norman Group](https://www.nngroup.com/) blog post. I even ALMOST convinced my company to send me to the NNG UX conference one time. So consider me qualified 🤷‍♂️\n\nCurrent projects of mine (that I designed and developed) can be found [here](/#projects).\n\nAdditionally, here are some screenshots from websites I’ve made over the years. All but one is - or was at one point - an actual live website…. not just a mockup.\n\n![](img/designs/showuply-4-browser.jpg)\n\n![](img/designs/showuply-2-browser.png)\n\n![](img/designs/showuply-browser.png)\n\n<p class='caption'>I’ve been an all-or-nothing person most of my life. It’s mostly gone away in the past couple of years, as I’ve figured out who I am and what I want (not an easy task). But prior to that, I would make grand plans and have trouble following through. So I made this community to help people like me (there are a bunch of us) not quit when things got boring, or when we were feeling like imposters, or whatevs.</p>\n\n![](img/designs/feedhero-browser.png)\n\n<p class='caption'>I made this pretty sophisticated Twitter Relationship Manager tool to seriously encourage authentic Twitter relationships. And I got about 35 people to pay for it and use it. But over time, I (and many of my users) started to realize that the best way to have authentic relationships was actually to skip Twitter altogether.</p>\n\n![](img/designs/safecars-browser.png)\n\n<p class='caption'>My (now ex) wife got in a bad car accident, and when she went to get a new car we couldn’t find a single service that let you search for used cars by safety AND price at the same time. So I compiled the data from a few different sources and made the site myself. We went with a 2009 Subaru Forester FWIW.</p>\n\n![](img/designs/noncents-1-browser.jpg)\n\n![](img/designs/noncents-2-browser.png)\n\n<p class='caption'>I got into this crypto phase for… about two months… and then I realized that I didn’t care at all, so this website went bye bye.</p>\n\n![](img/designs/justfreakingpublish-browser.jpg)\n\n<p class='caption'>I quite like accountability tools/communties/ideas. Discipline is overrated.</p>\n\n![](img/designs/commute-guardian-browser.jpg)\n\n<p class='caption'>Made at and for Luxonis. This one is still publicly live.</p>\n\n![](img/designs/beeminder-browser.jpg)\n\n<p class='caption'>A mockup I made for my friends at Beeminder. Because I really love their product but could never get past the 1990s web design. This is the only of these design screenshots that was snapped from Sketch… all the rest were taken from live websites (though most on my local server).</p>"
    },
    {
      "title": "Full-Stack Developer",
      "content": "My go-to stack these days is [NuxtJS](https://nuxtjs.org/) + [VueJS](https://vuejs.org/) + [TailwindCSS](https://tailwindcss.com/) + [NetlifyCMS](https://www.netlifycms.org/) on the frontend, all hosted on [Netlify](https://www.netlify.com/). And then [Lumen](https://lumen.laravel.com/) + MySQL for the backend (though I’ve started to play with [Firebase](https://firebase.google.com/)).\n\nBut I go far beyond that stack.\n\nI made [this 4.7-star iOS App](https://apps.apple.com/us/app/dealcatcher-coupons-deals-shopping-app/id534634276), [this Rails site](https://www.dealcatcher.com/), [this custom-MVC site](https://www.pickmonitor.com/), [this Vue site](https://luxonis.com/), and too many [Laravel](https://laravel.com/) sites to count.\n\nI’ve worked with [Jekyll](https://jekyllrb.com/), [Flutter](https://flutter.dev/), [WordPress](https://wordpress.org/), and [Shopify](https://shopify.com). I’ve installed beautiful [Flarum](https://flarum.org) forums like [this one](https://discuss.luxonis.com). I, of course, speak the much-hated [jQuery](https://jquery.com/) (but haven’t used it in some time). I’ve done brief C and C++ firmware development.\n\nI use postman, composer, npm, and scss, and probably whatever else you use.\n\nDo I have X years of experience with Y specific framework? I don’t know. Probably not. But if you’re judging a candidate based on whether they have experience with Vue versus whether they have experience with React… I not-so-humbly think you’re doing it wrong.\n\nOh, and also, the things I make are crisp AF. As just one silly example, here’s the Page Speed for this site on my very first check, before a single optimization. Swear to Zeus.\n\n![](/img/shots/speed.png)"
    },
    {
      "title": "Machine Learning Engineer",
      "content": "I spent the majority of my time at [Luxonis](https://luxonis.com) doing Machine Learning Engineering and Computer Vision work. Sadly the bulk of that work was done under NDA for a third party, so I can't really talk about what I did (which is pretty freaking cool, actually) or share any results.\n\nEssentially all I can say is that I got very good at object tracking and detection, semantic segmentation, and absurd debugging.\n\nI also learned how to do lots of completely useless things like:\n\n![](img/shots/useless-ml-contour.jpg)\n\n<p class='caption'>A photo from outside the Prague hostel I volunteered at in Aug 2018. Using my mad Machine Learning skills to turn it into this very very definitely useful contour drawing.</p>\n\n![](img/shots/probably-a-person.png)\n\n<p class='caption'>Or look how I can show disbelievers that yes, I am in fact 91% likely to be a person!</p>\n\n![](img/shots/video-game-patrick.jpeg)\n\n<p class='caption'>I can also pretend to be the superstar of Ultime Friz, the video game.</p>"
    },
    {
      "title": "Conversion Rate Specialist",
      "content": "Imagine you have a subscription service. And you sell subscriptions via your website. On your website:\n- 3% of your website visitors sign up to a free trial.\n- 14% of those convert to a paid subscription.\n- The average subscription price is $49/mo.\n- The average subscription length is 4.1 months.\n\nSo each website visitor, excluding costs, is 'worth' $0.84 to you.\n\nThen you hire me.\n\nI notice that only 28% of your visitors are staying for more than 5 seconds. Hmmm. I hypothesize that your 'outdated' design and your lack of clear Unique Selling Proposition is to blame for this. So I do a quick redesign of your website, and rewrite some of your copy to be both more direct and to trigger more curiosity. And we get that number up to 72%. This doesn't mean that 72% of people care about what you're doing... but they're at least intrigued enough to investigate.\n\nNow our free trial signups are at 7.7%. But I think we can do better. \n\nThe current signup process is full of friction. The visitor sees some screenshots of what awaits inside, but then she must create an account before playing around. Well, even if account creation only takes 20 seconds, it's still one hell of a mental barrier. So I hypothesize that we'll see an increase in free trials if we borrow from the 'show don’t tell' mantra and let visitors start playing with the most basic features - populated with dummy data - right on the home page without creating an account. Of course most of the people who play with this fake demo don't then create an account. But many do.\n\nNow our free trial signups are up to 19.2%. Seems like we've plucked the lowest hanging fruit, so we'll move on to paid conversions.\n\n14% of free trials convert to paid. Why? Well, pretty simply, people aren't using our service. We don't have a conversion problem so much as an onboarding problem. We give people a 14-day trial, but only 20% of them come back for day 2. So really... of the people who come back to use the tool again, our conversion rate is GREAT!\n\nWe hypothesize that we can get people to keep using the trial by getting them invested in the tool. So we first implement an open-source Onboarding Tour tool that walks them through the most important features. And then we get them to add some data, and learn the system. And finally we implement an email series that follows up with people who are at risk of going cold, prompting them with inviting hooks about finishing pending tasks.\n\nNow 48% of people actually USE the free trial, and although the relative conversion rate to paid goes down, now 26% of free trial users convert to paid.\n\nThen we increase the average (and only) subscription price from $49/mo to $72/mo by introducing $69 and $299 tiers alongside the $49 one. It's simple pricing psychology. The $299 option makes $69 and $49 look affordable. And we add some benefits to the $69 option that, by comparison, makes it look like a 'no-brainer'.\n\nAnd finally we almost double subscription length (or 'reduce churn' if you're feeling hip) - from 4.1 months to 7.9 months - primarily by setting up alerts that tell us when people are starting to lose interest with our service - so we can then reach out personally (not with a robot) to see what's going on, and to let them know that a real human actually exists behind all of this. Often people abandon because we're no longer meeting their needs, so this doubles as invaluable product research.\n\nAltogether, these changes mean that now each visitor is worth $28.39.\n\nOf course these numbers are bullshit. They aren't your numbers. And your gains won't be nearly this dramatic unless your site is wickedly underoptimized. But regardless, the point is that conversion rate optimization can border on magical.\n\nNote that I only work with companies who put people over profit, so I'm not going to help you make more money purely for the sake of making more money. But... revenue is necessary. And more revenue generally means more ability to spread your mission. So if you're doing something good, and more money means more ability to do more of that good... let's do it!"
    },    
    {
      "title": "Copywriter",
      "content": "The ability to tell stories is important. Especially in this age where scams run amuck. Where nobody knows or trusts each other. Where markets are crowded and the reason to choose you lies largely in the intangibles."
    },
    {
      "title": "Search Engine Optimizer",
      "content": "I spent an entire year of my life, whilst [here](https://dealcatcher.com/), doing nothing but optimizing internet stuff for The Googs. I would not recommend others follow in my footsteps. "
    }      
  ],
  "title": "Experience",
  "intro": "Since receving a B.S. in Computer Science from the University of Delaware in 2009 I've had 11 years of professional experience spanning the following roles. I like wearing multiple hats."
}