{
  "expands": [    
    {
      "title": "Full-Stack Engineering",
      "content": "My go-to stack these days is:\n\n- Frontend: [NuxtJS](https://nuxtjs.org/) + [VueJS](https://vuejs.org/) + [TailwindCSS](https://tailwindcss.com/), all hosted on [Netlify](https://www.netlify.com/).\n- Backend: [Lumen](https://lumen.laravel.com/) + MySQL, hosted on Digital Ocean, AWS, or Azure (all of which I can setup and maintain).\n\nBut I go far beyond that stack. I made [this 4.7-star iOS App](https://apps.apple.com/us/app/dealcatcher-coupons-deals-shopping-app/id534634276), [this Rails site](https://www.dealcatcher.com/), [this custom-MVC site](https://www.pickmonitor.com/), and too many [Laravel](https://laravel.com/) sites to count. I’ve worked with [Jekyll](https://jekyllrb.com/), [Flutter](https://flutter.dev/), [WordPress](https://wordpress.org/), and [Shopify](https://shopify.com). I’ve installed beautiful [Flarum](https://flarum.org) forums like [this one](https://discuss.luxonis.com). I, of course, speak the much-hated [jQuery](https://jquery.com/) (but haven’t used it in some time).\n\nI use postman, composer, npm, webpack, scss, and probably whatever else you use.\n\nDo I have X years of experience with Y specific framework? I don’t know. Probably not. But I’m really good at - and ridiculously excited about - learning new technologies. So if I need to learn ElectronJS or TypeScript or Firebase or Django or NoSQL or whatever else... I'll consider it a perk."
    },
    {
      "title": "Machine Learning Engineering",
      "content": "I spent the majority of my time at [Luxonis](https://luxonis.com) doing Machine Learning Engineering and Computer Vision work. Sadly the bulk of that work was done under NDA for a third party, so I can't really talk about what I did (which is pretty freaking cool, actually) or share any results.\n\nEssentially all I can say is that I got very good at object tracking and detection, semantic segmentation, and absurd debugging.\n\nI also learned how to do lots of completely useless things like:\n\n![](img/shots/useless-ml-contour.jpg)\n\n<p class='caption'>A photo from outside the Prague hostel I volunteered at in Aug 2018. Using my mad Machine Learning skills to turn it into this very very definitely useful contour drawing.</p>\n\n![](img/shots/probably-a-person.png)\n\n<p class='caption'>Or look how I can show disbelievers that yes, I am in fact 91% likely to be a person!</p>\n\n![](img/shots/video-game-patrick.jpeg)\n\n<p class='caption'>I can also pretend to be the superstar of Ultime Friz, the video game.</p>"
    },
    {
      "title": "Data Collection and Processing",
      "content": "AKA an affinity for scraping the hell out of websites, and then writing SQL queries to make sense out of that data. As a silly example, one time I decided where to move by crawling climate, coffee-shop-per-capita, and other data from 40k different USA cities. And then later I moved to Portland where it’s always raining. Which I suppose is a lesson that the data doesn't always tell the whole story?"
    },
    {
      "title": "UI/UX Design",
      "content": "UI/UX design has not come easily or naturally to me. And I’m still not that good at it. But even stll, it’s a valuable part of my skillset for three reasons:\n1. Understanding and caring about design sooooo strongly impacts the amount of detail and polish that goes into my engineering work. Those tiny extra touches, the hover states, the transitions, the polished error messages... those things are important to me. I care about what I build.\n2. Design systems are so powerful, and (especially frontend) engineering can benefit from that same sort of idealogy.\n3. I can way more easily work with designers.  \n\nI have a few years of experience with Sketch, but these days I design almost exclusively in Figma.\n\nCurrent projects of mine (that I designed and developed) can be found [here](/projects).\n\nAdditionally, here are some screenshots from websites I’ve made over the years. All but one is - or was at one point - an actual live website…. not just a mockup.\n\n![](img/designs/showuply-4-browser.jpg)\n\n![](img/designs/showuply-2-browser.png)\n\n![](img/designs/showuply-browser.png)\n\n<p class='caption'>I’ve been an all-or-nothing person most of my life. It’s mostly gone away in the past couple of years, as I’ve figured out who I am and what I want (not an easy task). But prior to that, I would make grand plans and have trouble following through. So I made this community to help people like me (there are a bunch of us) not quit when things got boring, or when we were feeling like imposters, or whatevs.</p>\n\n![](img/designs/feedhero-browser.png)\n\n<p class='caption'>I made this pretty sophisticated Twitter Relationship Manager tool to seriously encourage authentic Twitter relationships. And I got about 35 people to pay for it and use it. But over time, I (and many of my users) started to realize that the best way to have authentic relationships was actually to skip Twitter altogether.</p>\n\n![](img/designs/safecars-browser.png)\n\n<p class='caption'>My (now ex) wife got in a bad car accident, and when she went to get a new car we couldn’t find a single service that let you search for used cars by safety AND price at the same time. So I compiled the data from a few different sources and made the site myself. We went with a 2009 Subaru Forester FWIW.</p>\n\n![](img/designs/noncents-1-browser.jpg)\n\n![](img/designs/noncents-2-browser.png)\n\n<p class='caption'>I got into this crypto phase for… about two months… and then I realized that I didn’t care at all, so this website went bye bye.</p>\n\n![](img/designs/justfreakingpublish-browser.jpg)\n\n<p class='caption'>I quite like accountability tools/communties/ideas. Discipline is overrated.</p>\n\n![](img/designs/commute-guardian-browser.jpg)\n\n<p class='caption'>Made at and for Luxonis. This one is still publicly live.</p>\n\n![](img/designs/beeminder-browser.jpg)\n\n<p class='caption'>A mockup I made for my friends at Beeminder. Because I really love their product but could never get past the 1990s web design. This is the only of these design screenshots that was snapped from Sketch… all the rest were taken from live websites (though most on my local server).</p>"
    },
    {
      "title": "Conversion Rate Optimization",
      "content": "Once we understand our mission... improving on that mission can be almost formulaic. We take a teaspoon of empathy, a pinch of psychology study, and a dash of intuition to make some hypotheses. Then we test those hypotheses.\n\nWhether we use electric code or quirky design or tomfoolerish writing depends on what we’re testing. The thing that makes me standout - versus someone who specializes in wearing a single hat - is my ability to employ the totality of this scientific method. To go from A to Z entirely on my own, and then start back from A again. To test changes without being asked to do so by the marketing department, and without needing to contact the design department for assistance.\n\nWithout empathy and marketing chops, it's hard to think about the changes that might make the most impact. And without a broad array of technical skillz, there aren't many meaningful changes that one can test."
    }, 
    {
      "title": "Branding and Copywriting",
      "content": "Stories are important. Especially in this age where scams, disinformation, and questionable motives run amuck. Where nobody knows or trusts each other. Where markets are crowded and the reason to choose you lies largely in the intangibles.\n\nAny marketing book is quick to tell you that we humans aren't as rational as we like to pretend. Even the most introspective of us are tribal. And so the software that we make must touch the hearts of the people that we make it for.\n\n"
    },
    {
      "title": "Search Engine Optimization",
      "content": "I spent an entire year of my life, whilst [here](https://dealcatcher.com/), doing nothing but optimizing internet stuff for The Googs. I would not recommend others follow in my footsteps. I really don’t enjoy this work, but it’s a great awareness to have in the back of my mind while doing other work."
    },
    {
      "title": "DevOps/SysAdmin",
      "content": "Linux say what?"
    }
  ],
  "title": "Experience",
  "intro": "11 years ago I got my B.S. in Computer Science (which you totally don’t need to be a dope programmer). Then I started and sold an online business. And since then I've held roles ranging from Senior Frontend Engineer to Chief Information Officer.\n\nIf you have a software problem - regardless of discipline, technology, or scope - chances are I can tackle it. Here are the skills I bring to the table:",
  "outro": "[Check out my portfolio](/projects) to see these skills in action. 'Cuz showing is better than telling."
}